app/views/likes/_like.html.haml

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 20
---
      %i.fa.fa-heart
    = post.likes.count