app/views/users/show.html.haml


-# = line_chart Post.group(:calorie).count
---
SELECT COUNT(*) FROM `posts` WHERE `posts`.`user_id` = 3