app/views/posts/_post.html.haml

              %i.fa.fa-commenting-o
            = post.comments.count
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 16