app/controllers/calendars_controller.rb

  def index
  @sampleuser = User.find_by(id: 2)
    if user_signed_in?
      @posts = Post.where(user_id: current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3