app/controllers/charts_controller.rb

SELECT SUM(`posts`.`calorie`) AS sum_calorie, date(created_at) AS date_created_at FROM `posts` WHERE `posts`.`user_id` = 3 GROUP BY date(created_at)
SELECT `posts`.`created_at` FROM `posts` WHERE `posts`.`user_id` = 3 GROUP BY date(created_at)
---
  def index
    # 日付ごとで分けてカロリー合計を算出
    sum_calorie = current_user.posts.group("date(created_at)").sum(:calorie)