app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @like = current_user.likes.build(post_id: params[:post_id])
    @like.save
    @likeCounts = Like.where(post_id: params[:post_id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 19 LIMIT 1
INSERT INTO `likes` (`user_id`, `post_id`, `created_at`, `updated_at`) VALUES (3, 19, '2020-10-19 11:31:16', '2020-10-19 11:31:16')
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 19
SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` = 19