app/controllers/posts_controller.rb

  def index
    @posts = Post.all.includes(:user).order("created_at DESC").page(params[:page]).per(5)
    @post = Post.new
    @user = current_user
    @sampleuser = User.find_by(id: 2)

    # グラフに必要なデータを表示させるための変数を条件分岐
    if user_signed_in?
      @user = current_user
      @calorie_sum = Post.where(user_id: current_user.id, created_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day).sum(:calorie)
      gon.today_sum = @calorie_sum
      @standard = Standard.find_by(user_id: current_user.id)
---
SELECT  `posts`.* FROM `posts` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 3)
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT SUM(`posts`.`calorie`) FROM `posts` WHERE `posts`.`user_id` = 2 AND `posts`.`created_at` BETWEEN '2020-10-16 15:00:00' AND '2020-10-17 14:59:59'
SELECT  `standards`.* FROM `standards` WHERE `standards`.`user_id` = 2 LIMIT 1

  def create
    @post = Post.new(post_params)
    # 今日の日付を取得(simple_calendarのため)
    @post[:start_time] = Date.today.strftime("%Y-%m-%d")
    if @post.save
---
INSERT INTO `posts` (`food`, `calorie`, `protein`, `fat`, `carbo`, `text`, `image`, `created_at`, `updated_at`, `user_id`, `weight`, `start_time`) VALUES ('坦々麺', 83.0, 3.2, 3.9, 10.7, 'こういうの初めて食べたけど結構美味しかった', 'A182B358-2FA6-4921-9860-30A46838216D.jpeg', '2020-10-19 11:38:09', '2020-10-19 11:38:09', 3, 63.4, '2020-10-18 15:00:00')

  def show
    @post = Post.find(params[:id])
    impressionist(@post)
    @comment = Comment.new
    @comments = @post.comments.includes(:user).order("created_at DESC")
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 39 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 39 ORDER BY created_at DESC

  def destroy
    post = Post.find(params[:id])
    post.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 47 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 47

  def image
    @sampleuser = User.find_by(id: 2)
    if user_signed_in?
      @posts = Post.where(user_id: current_user.id).where.not(image: nil).order("created_at DESC")
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3 AND `posts`.`image` IS NOT NULL ORDER BY created_at DESC