app/controllers/relationships_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    @user = User.find(params[:relationship][:following_id])