app/controllers/users_controller.rb

  def show
    if user_signed_in?
      @user = User.find(params[:id])
      @posts = Post.where(user_id: @user.id).order("created_at DESC").page(params[:page]).per(5)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts` WHERE `posts`.`user_id` = 3

  def following
    if user_signed_in?
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def followers
    if user_signed_in?
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1