app/controllers/users_controller.rb

  def show
    if user_signed_in?
      @user = User.find(params[:id])
      @posts = Post.where(user_id: @user.id).order("created_at DESC")
      @calorie = @user.posts.order("created_at DESC").group("date(created_at)").sum(:calorie)
---
SELECT SUM(`posts`.`calorie`) AS sum_calorie, date(created_at) AS date_created_at FROM `posts` WHERE `posts`.`user_id` = 3 GROUP BY date(created_at) ORDER BY created_at DESC