app/controllers/users/registrations_controller.rb

INSERT INTO `standards` (`weight`, `calorie`, `protein`, `fat`, `carbo`, `user_id`, `created_at`, `updated_at`, `bodyFatPercentage`, `leanBodyMass`) VALUES (63.0, 2066.0, 129, 46.0, 284.0, 20, '2020-10-23 10:22:09', '2020-10-23 10:22:09', 18.0, 52.0)
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `name`) VALUES ('yoshi@gmail.com', '$2a$11$N/17tU0Kso/OHHdGbNr1gOeFWBEp3IilETnSRnPHUuHx2XvoyLoXO', '2020-10-23 10:22:08', '2020-10-23 10:22:08', 'yoshi')
---
  def create_standard
    @user = User.new(session["devise.regist_data"]["user"])
    @standard = Standard.new(standard_params)
    unless @standard.valid?
      flash.now[:alert] = @standard.errors.full_messages
      render :new_standard and return
    end
    @user.build_standard(@standard.attributes)
    @user.save